In [1]:
#Q1. List any five functions of the pandas library with execution.

In [2]:
import pandas as pd

In [3]:
# 1.df=pd.read_csv("Titanic.csv")

In [4]:
#2. df.head()

In [5]:
# 5.df.tail()

In [6]:
# 4.df.describe()

In [7]:
# 5. df.pivot table()

In [8]:
data = {
    'City': ['New York', 'Los Angeles', 'New York', 'Chicago', 'Los Angeles'],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Male'],
    'Age': [25, 30, 22, 28, 32]
}
df = pd.DataFrame(data)

In [9]:
pivot_table = df.pivot_table(index='City', columns='Gender', values='Age', aggfunc='mean')

In [10]:
pivot_table

Gender       Female  Male
City
Chicago         NaN  28.0
Los Angeles     NaN  31.0
New York       23.5   NaN

In [11]:
#Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
# DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [12]:
def reindex_with_custom_increment(df):
    new_index = range(1, len(df) * 2 + 1, 2)  # Create a new index with the desired increment
    df_reindexed = df.reset_index(drop=True)  # Reset the existing index and drop it
    df_reindexed.index = new_index  # Assign the new index to the DataFrame
    return df_reindexed

# Example DataFrame
data = {
    'A': [10, 20, 30, 40],
    'B': [100, 200, 300, 400],
    'C': [1000, 2000, 3000, 4000]
}
df = pd.DataFrame(data)

# Re-index the DataFrame
new_df = reindex_with_custom_increment(df)

print(new_df)

    A    B     C
1  10  100  1000
3  20  200  2000
5  30  300  3000
7  40  400  4000

In [13]:
data = {
    'A': [10, 20, 30, 40],
    'B': [100, 200, 300, 400],
    'C': [1000, 2000, 3000, 4000]
}
df = pd.DataFrame(data)

In [14]:
def re_indexed(df):
    df[""]= range(1,len(df)*2+1,2)
    re=df.set_index("")
    return re

In [15]:
new_df=re_indexed(df)

In [16]:
new_df

    A    B     C

1  10  100  1000
3  20  200  2000
5  30  300  3000
7  40  400  4000

In [17]:
# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
# iterates over the DataFrame and calculates the sum of the first three values in the
# 'Values' column. Thefunction should print the sum to the console.
# For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50],
# your function shouldcalculate and print the sum of the first three values, which is 60.

In [18]:
data={'key_1':[1,2,3,4,5,6],
     'Values':[10,20,30,40,50,60]}
df1=pd.DataFrame(data)

In [19]:
def sum_values(x):
    re=df1['Values'][0:x].sum()
    return re

In [20]:
A=sum_values(3)

In [21]:
print(A)

60

In [28]:
#Q13 To use the basic functions of pandas, what is the first and foremost necessary library that needs to
# be imported?

In [29]:
#To use the basic function of pandas  we used  import an pandas library.

In [40]:
#Q5. How are DataFrame.size() and DataFrame.shape() different?

In [41]:
import pandas as pd

data = {'A': [1, 2, 3], 'B': [4, 5, 6]}
df = pd.DataFrame(data)

size = df.size
shape = df.shape

In [42]:
size # Returns 6 (2 rows x 3 columns = 6 elements)

6

In [43]:
shape  # Returns (2 rows , 3 columns )

(3, 2)

In [44]:
# Q6. Which function of pandas do we use to read an excel file?

In [45]:
# we use  pd.read_excel("file_name with extension")

In [46]:
#Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
# addresses in the format 'username@domain.com'. Write a Python function that creates a new column
# 'Username' in df that contains only the username part of each email address.

In [57]:
import pandas as pd
data={"key_1":["Gaurav06704@gmail.com","Praveen@gmail.com","Harsh123@gmail.com","Gazal123@gmail.c"]}
df=pd.DataFrame(data)
data1

                   key_1
0  Gaurav06704@gmail.com
1      Praveen@gmail.com
2     Harsh123@gmail.com
3       Gazal123@gmail.c

In [63]:
def extract_user(x):
    df["Username"]=df["key_1"].str.split("@").str.get(0)
    return df

In [64]:
Ex=extract_user(df)

In [65]:
Ex

                   key_1     Username
0  Gaurav06704@gmail.com  Gaurav06704
1      Praveen@gmail.com      Praveen
2     Harsh123@gmail.com     Harsh123
3       Gazal123@gmail.c     Gazal123

In [66]:
#Q8.Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
# all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
# function should return a new DataFrame that contains only the selected rows.

In [68]:
Data={"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]}
Data1=pd.DataFrame(Data)

In [69]:
Data1

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [71]:
def fun(x):
    df=Data1.query("A>5 and B<10")
    return df

In [73]:
fun(Data1)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [74]:
#Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
# median, and standard deviation of the values in the 'Values' column.

In [78]:
Data={"Values":[1,3,5,7,9,11,13,15,17,19]}
Data1= pd .DataFrame(Data)
def fun1(x):
    Mean=Data1["Values"].mean()
    Median=Data1["Values"].median()
    std=Data1["Values"].std()
    return Mean,Median,std

In [81]:
Stats=fun1(Data1)#(Mean.Median,std)

In [82]:
Stats#(Mean.Median,std)

(10.0, 10.0, 6.0553007081949835)

In [83]:
# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
# create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
# for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
# should include the current day.

In [84]:
data = {'Date': ['2023-08-01', '2023-08-02', '2023-08-03', '2023-08-04', '2023-08-05'],
        'Sales': [100, 150, 120, 200, 180]}
df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])

In [85]:
def calculate_moving_average(df, window_size=7):
    df['MovingAverage'] = df['Sales'].rolling(window=window_size, min_periods=1).mean()
    return df

In [86]:
data=calculate_moving_average(df)

In [87]:
data

        Date  Sales  MovingAverage
0 2023-08-01    100     100.000000
1 2023-08-02    150     125.000000
2 2023-08-03    120     123.333333
3 2023-08-04    200     142.500000
4 2023-08-05    180     150.000000

In [88]:
#Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
# column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
# Monday, Tuesday) corresponding to each date in the 'Date' column.

In [89]:
data = {'Date': ['2023-08-01', '2023-08-02', '2023-08-03', '2023-08-04', '2023-08-05']}
df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date'])

In [92]:
def func1(x):
    df['Weekday'] = df['Date'].dt.strftime('%A')
    return df

In [93]:
Data=func1(df)

In [94]:
Data

        Date    Weekday
0 2023-08-01    Tuesday
1 2023-08-02  Wednesday
2 2023-08-03   Thursday
3 2023-08-04     Friday
4 2023-08-05   Saturday